{"modelTopology":{"node":[{"input":[],"attr":{"dtype":{"type":1},"shape":{"shape":{"dim":[{"size":"-1"},{"size":"28"},{"size":"28"},{"size":"1"}]}}},"name":"MyInput","op":"Placeholder"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1"},{"size":"6"}]}}},"dtype":{"type":1}},"name":"Variable","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"6"}]}}},"dtype":{"type":1}},"name":"Variable_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"6"},{"size":"16"}]}}},"dtype":{"type":1}},"name":"Variable_2","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":1}},"name":"Variable_3","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"Flatten/flatten/strided_slice/stack","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"Flatten/flatten/strided_slice/stack_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"Flatten/flatten/Reshape/shape/1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"},{"size":"120"}]}}},"dtype":{"type":1}},"name":"Variable_4","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"120"}]}}},"dtype":{"type":1}},"name":"Variable_5","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"120"},{"size":"84"}]}}},"dtype":{"type":1}},"name":"Variable_6","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"84"}]}}},"dtype":{"type":1}},"name":"Variable_7","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"84"},{"size":"10"}]}}},"dtype":{"type":1}},"name":"Variable_8","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"10"}]}}},"dtype":{"type":1}},"name":"Variable_9","op":"Const"},{"input":["MyInput","Variable"],"attr":{"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true}},"name":"Conv2D","op":"Conv2D"},{"input":["Conv2D","Variable_1"],"attr":{"T":{"type":1}},"name":"add","op":"Add"},{"input":["add"],"attr":{"T":{"type":1}},"name":"MyConv2D_1","op":"Relu"},{"input":["MyConv2D_1"],"attr":{"padding":{"s":[86,65,76,73,68]},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"ksize":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}}},"name":"MyMaxPooling2D_1","op":"MaxPool"},{"input":["MyMaxPooling2D_1","Variable_2"],"attr":{"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true}},"name":"Conv2D_1","op":"Conv2D"},{"input":["Conv2D_1","Variable_3"],"attr":{"T":{"type":1}},"name":"add_1","op":"Add"},{"input":["add_1"],"attr":{"T":{"type":1}},"name":"MyConv2D_2","op":"Relu"},{"input":["MyConv2D_2"],"attr":{"ksize":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"padding":{"s":[86,65,76,73,68]},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]}},"name":"MyMaxPooling2D_2","op":"MaxPool"},{"input":["MyMaxPooling2D_2"],"attr":{"T":{"type":1},"out_type":{"type":3}},"name":"Flatten/flatten/Shape","op":"Shape"},{"input":["Flatten/flatten/Shape","Flatten/flatten/strided_slice/stack","Flatten/flatten/strided_slice/stack_1","Flatten/flatten/strided_slice/stack_1"],"attr":{"shrink_axis_mask":{"i":"1"},"begin_mask":{"i":"0"},"ellipsis_mask":{"i":"0"},"new_axis_mask":{"i":"0"},"end_mask":{"i":"0"},"Index":{"type":3},"T":{"type":3}},"name":"Flatten/flatten/strided_slice","op":"StridedSlice"},{"input":["Flatten/flatten/strided_slice","Flatten/flatten/Reshape/shape/1"],"attr":{"T":{"type":3},"axis":{"i":"0"},"N":{"i":"2"}},"name":"Flatten/flatten/Reshape/shape","op":"Pack"},{"input":["MyMaxPooling2D_2","Flatten/flatten/Reshape/shape"],"attr":{"T":{"type":1},"Tshape":{"type":3}},"name":"Flatten/flatten/Reshape","op":"Reshape"},{"input":["Flatten/flatten/Reshape","Variable_4"],"attr":{"transpose_a":{"b":false},"transpose_b":{"b":false},"T":{"type":1}},"name":"MatMul","op":"MatMul"},{"input":["MatMul","Variable_5"],"attr":{"T":{"type":1}},"name":"add_2","op":"Add"},{"input":["add_2"],"attr":{"T":{"type":1}},"name":"MyDense_1","op":"Relu"},{"input":["MyDense_1","Variable_6"],"attr":{"T":{"type":1},"transpose_a":{"b":false},"transpose_b":{"b":false}},"name":"MatMul_1","op":"MatMul"},{"input":["MatMul_1","Variable_7"],"attr":{"T":{"type":1}},"name":"add_3","op":"Add"},{"input":["add_3"],"attr":{"T":{"type":1}},"name":"MyDense_2","op":"Relu"},{"input":["MyDense_2","Variable_8"],"attr":{"transpose_a":{"b":false},"transpose_b":{"b":false},"T":{"type":1}},"name":"MatMul_2","op":"MatMul"},{"input":["MatMul_2","Variable_9"],"attr":{"T":{"type":1}},"name":"add_4","op":"Add"},{"input":["add_4"],"attr":{"T":{"type":1}},"name":"MySoftMax","op":"Softmax"}],"library":{"function":[],"gradient":[]},"versions":{"badConsumers":[]}},"weightsManifest":[{"paths":["group1-shard1of1"],"weights":[{"name":"Variable","shape":[5,5,1,6],"dtype":"float32"},{"name":"Variable_1","shape":[6],"dtype":"float32"},{"name":"Variable_2","shape":[5,5,6,16],"dtype":"float32"},{"name":"Variable_3","shape":[16],"dtype":"float32"},{"name":"Flatten/flatten/strided_slice/stack","shape":[1],"dtype":"int32"},{"name":"Flatten/flatten/strided_slice/stack_1","shape":[1],"dtype":"int32"},{"name":"Flatten/flatten/Reshape/shape/1","shape":[],"dtype":"int32"},{"name":"Variable_4","shape":[256,120],"dtype":"float32"},{"name":"Variable_5","shape":[120],"dtype":"float32"},{"name":"Variable_6","shape":[120,84],"dtype":"float32"},{"name":"Variable_7","shape":[84],"dtype":"float32"},{"name":"Variable_8","shape":[84,10],"dtype":"float32"},{"name":"Variable_9","shape":[10],"dtype":"float32"}]}]}