{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "batch_input_shape": [null, 28, 28], "dtype": "float32", "target_shape": [28, 28, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "Conv2D_1", "class_name": "Conv2D", "config": {"name": "Conv2D_1", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "MaxPooling2D_1", "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["Conv2D_1", 0, 0, {}]]]}, {"name": "Conv2D_2", "class_name": "Conv2D", "config": {"name": "Conv2D_2", "trainable": true, "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPooling2D_1", 0, 0, {}]]]}, {"name": "MaxPooling2D_2", "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["Conv2D_2", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["MaxPooling2D_2", 0, 0, {}]]]}, {"name": "Dense_1", "class_name": "Dense", "config": {"name": "Dense_1", "trainable": true, "units": 120, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "Dense_2", "class_name": "Dense", "config": {"name": "Dense_2", "trainable": true, "units": 84, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Dense_1", 0, 0, {}]]]}, {"name": "Softmax", "class_name": "Dense", "config": {"name": "Softmax", "trainable": true, "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Dense_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["Conv2D_1", 0, 0], ["MaxPooling2D_1", 0, 0], ["Conv2D_2", 0, 0], ["MaxPooling2D_2", 0, 0], ["Dense_1", 0, 0], ["Dense_2", 0, 0], ["Softmax", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "Conv2D_1/kernel", "shape": [5, 5, 1, 6], "dtype": "float32"}, {"name": "Conv2D_1/bias", "shape": [6], "dtype": "float32"}, {"name": "Conv2D_2/kernel", "shape": [5, 5, 6, 16], "dtype": "float32"}, {"name": "Conv2D_2/bias", "shape": [16], "dtype": "float32"}, {"name": "Dense_1/kernel", "shape": [256, 120], "dtype": "float32"}, {"name": "Dense_1/bias", "shape": [120], "dtype": "float32"}, {"name": "Dense_2/kernel", "shape": [120, 84], "dtype": "float32"}, {"name": "Dense_2/bias", "shape": [84], "dtype": "float32"}, {"name": "Softmax/kernel", "shape": [84, 10], "dtype": "float32"}, {"name": "Softmax/bias", "shape": [10], "dtype": "float32"}]}]}