{"modelTopology":{"node":[{"input":[],"attr":{"value":{"tensor":{"floatVal":[0.10000000149011612],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[]}}},"dtype":{"type":1}},"name":"mul_7/x","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"16"}]}}},"dtype":{"type":1}},"name":"Variable","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":1}},"name":"Variable_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"32"}]}}},"dtype":{"type":1}},"name":"Variable_2","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":1}},"name":"Variable_3","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"64"}]}}}},"name":"Variable_4","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"Variable_5","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"128"}]}}}},"name":"Variable_6","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"Variable_7","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"Variable_8","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"Variable_9","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"512"}]}}}},"name":"Variable_10","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":1}},"name":"Variable_11","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1024"}]}}},"dtype":{"type":1}},"name":"Variable_12","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":1}},"name":"Variable_13","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1024"},{"size":"1024"}]}}},"dtype":{"type":1}},"name":"Variable_14","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":1}},"name":"Variable_15","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"125"}]}}},"dtype":{"type":1}},"name":"Variable_16","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"125"}]}}}},"name":"Variable_17","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"shape":{"shape":{"dim":[{"size":"1"},{"size":"416"},{"size":"416"},{"size":"3"}]}}},"name":"input/Placeholder","op":"Placeholder"},{"input":["input/Placeholder","Variable"],"attr":{"padding":{"s":[83,65,77,69]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true}},"name":"Conv2D","op":"Conv2D"},{"input":["Conv2D","Variable_1"],"attr":{"T":{"type":1}},"name":"add","op":"Add"},{"input":["mul_7/x","add"],"attr":{"T":{"type":1}},"name":"mul","op":"Mul"},{"input":["mul","add"],"attr":{"T":{"type":1}},"name":"Maximum","op":"Maximum"},{"input":["Maximum"],"attr":{"ksize":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"padding":{"s":[86,65,76,73,68]},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}}},"name":"MaxPool","op":"MaxPool"},{"input":["MaxPool","Variable_2"],"attr":{"padding":{"s":[83,65,77,69]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true}},"name":"Conv2D_1","op":"Conv2D"},{"input":["Conv2D_1","Variable_3"],"attr":{"T":{"type":1}},"name":"add_1","op":"Add"},{"input":["mul_7/x","add_1"],"attr":{"T":{"type":1}},"name":"mul_1","op":"Mul"},{"input":["mul_1","add_1"],"attr":{"T":{"type":1}},"name":"Maximum_1","op":"Maximum"},{"input":["Maximum_1"],"attr":{"ksize":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"padding":{"s":[86,65,76,73,68]},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]}},"name":"MaxPool_1","op":"MaxPool"},{"input":["MaxPool_1","Variable_4"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"Conv2D_2","op":"Conv2D"},{"input":["Conv2D_2","Variable_5"],"attr":{"T":{"type":1}},"name":"add_2","op":"Add"},{"input":["mul_7/x","add_2"],"attr":{"T":{"type":1}},"name":"mul_2","op":"Mul"},{"input":["mul_2","add_2"],"attr":{"T":{"type":1}},"name":"Maximum_2","op":"Maximum"},{"input":["Maximum_2"],"attr":{"ksize":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"padding":{"s":[86,65,76,73,68]},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}}},"name":"MaxPool_2","op":"MaxPool"},{"input":["MaxPool_2","Variable_6"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"Conv2D_3","op":"Conv2D"},{"input":["Conv2D_3","Variable_7"],"attr":{"T":{"type":1}},"name":"add_3","op":"Add"},{"input":["mul_7/x","add_3"],"attr":{"T":{"type":1}},"name":"mul_3","op":"Mul"},{"input":["mul_3","add_3"],"attr":{"T":{"type":1}},"name":"Maximum_3","op":"Maximum"},{"input":["Maximum_3"],"attr":{"ksize":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"padding":{"s":[86,65,76,73,68]},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}}},"name":"MaxPool_3","op":"MaxPool"},{"input":["MaxPool_3","Variable_8"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"Conv2D_4","op":"Conv2D"},{"input":["Conv2D_4","Variable_9"],"attr":{"T":{"type":1}},"name":"add_4","op":"Add"},{"input":["mul_7/x","add_4"],"attr":{"T":{"type":1}},"name":"mul_4","op":"Mul"},{"input":["mul_4","add_4"],"attr":{"T":{"type":1}},"name":"Maximum_4","op":"Maximum"},{"input":["Maximum_4"],"attr":{"ksize":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"padding":{"s":[86,65,76,73,68]},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}}},"name":"MaxPool_4","op":"MaxPool"},{"input":["MaxPool_4","Variable_10"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"Conv2D_5","op":"Conv2D"},{"input":["Conv2D_5","Variable_11"],"attr":{"T":{"type":1}},"name":"add_5","op":"Add"},{"input":["mul_7/x","add_5"],"attr":{"T":{"type":1}},"name":"mul_5","op":"Mul"},{"input":["mul_5","add_5"],"attr":{"T":{"type":1}},"name":"Maximum_5","op":"Maximum"},{"input":["Maximum_5"],"attr":{"ksize":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"padding":{"s":[83,65,77,69]},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]}},"name":"MaxPool_5","op":"MaxPool"},{"input":["MaxPool_5","Variable_12"],"attr":{"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}}},"name":"Conv2D_6","op":"Conv2D"},{"input":["Conv2D_6","Variable_13"],"attr":{"T":{"type":1}},"name":"add_6","op":"Add"},{"input":["mul_7/x","add_6"],"attr":{"T":{"type":1}},"name":"mul_6","op":"Mul"},{"input":["mul_6","add_6"],"attr":{"T":{"type":1}},"name":"Maximum_6","op":"Maximum"},{"input":["Maximum_6","Variable_14"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}}},"name":"Conv2D_7","op":"Conv2D"},{"input":["Conv2D_7","Variable_15"],"attr":{"T":{"type":1}},"name":"add_7","op":"Add"},{"input":["mul_7/x","add_7"],"attr":{"T":{"type":1}},"name":"mul_7","op":"Mul"},{"input":["mul_7","add_7"],"attr":{"T":{"type":1}},"name":"Maximum_7","op":"Maximum"},{"input":["Maximum_7","Variable_16"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"Conv2D_8","op":"Conv2D"},{"input":["Conv2D_8","Variable_17"],"attr":{"T":{"type":1}},"name":"add_8","op":"Add"}],"library":{"function":[],"gradient":[]},"versions":{"badConsumers":[]}},"weightsManifest":[{"paths":["group1-shard1of16","group1-shard2of16","group1-shard3of16","group1-shard4of16","group1-shard5of16","group1-shard6of16","group1-shard7of16","group1-shard8of16","group1-shard9of16","group1-shard10of16","group1-shard11of16","group1-shard12of16","group1-shard13of16","group1-shard14of16","group1-shard15of16","group1-shard16of16"],"weights":[{"name":"mul_7/x","shape":[],"dtype":"float32"},{"name":"Variable","shape":[3,3,3,16],"dtype":"float32"},{"name":"Variable_1","shape":[16],"dtype":"float32"},{"name":"Variable_2","shape":[3,3,16,32],"dtype":"float32"},{"name":"Variable_3","shape":[32],"dtype":"float32"},{"name":"Variable_4","shape":[3,3,32,64],"dtype":"float32"},{"name":"Variable_5","shape":[64],"dtype":"float32"},{"name":"Variable_6","shape":[3,3,64,128],"dtype":"float32"},{"name":"Variable_7","shape":[128],"dtype":"float32"},{"name":"Variable_8","shape":[3,3,128,256],"dtype":"float32"},{"name":"Variable_9","shape":[256],"dtype":"float32"},{"name":"Variable_10","shape":[3,3,256,512],"dtype":"float32"},{"name":"Variable_11","shape":[512],"dtype":"float32"},{"name":"Variable_12","shape":[3,3,512,1024],"dtype":"float32"},{"name":"Variable_13","shape":[1024],"dtype":"float32"},{"name":"Variable_14","shape":[3,3,1024,1024],"dtype":"float32"},{"name":"Variable_15","shape":[1024],"dtype":"float32"},{"name":"Variable_16","shape":[1,1,1024,125],"dtype":"float32"},{"name":"Variable_17","shape":[125],"dtype":"float32"}]}]}