{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"MyConv2D_1_input","class_name":"InputLayer","config":{"batch_input_shape":[null,28,28,1],"dtype":"float32","sparse":false,"name":"MyConv2D_1_input"},"inbound_nodes":[]},{"name":"MyConv2D_1","class_name":"Conv2D","config":{"filters":6,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"MyConv2D_1","trainable":true,"batch_input_shape":[null,28,28,1],"dtype":"float32"},"inbound_nodes":[[["MyConv2D_1_input",0,0,{}]]]},{"name":"MyMaxPooling_1","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"MyMaxPooling_1","trainable":true},"inbound_nodes":[[["MyConv2D_1",0,0,{}]]]},{"name":"MyConv2D_2","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"MyConv2D_2","trainable":true},"inbound_nodes":[[["MyMaxPooling_1",0,0,{}]]]},{"name":"MyMaxPooling_2","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"MyMaxPooling_2","trainable":true},"inbound_nodes":[[["MyConv2D_2",0,0,{}]]]},{"name":"flatten_Flatten2","class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true},"inbound_nodes":[[["MyMaxPooling_2",0,0,{}]]]},{"name":"MyDense_1","class_name":"Dense","config":{"units":120,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"MyDense_1","trainable":true},"inbound_nodes":[[["flatten_Flatten2",0,0,{}]]]},{"name":"MyDense_2","class_name":"Dense","config":{"units":84,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"MyDense_2","trainable":true},"inbound_nodes":[[["MyDense_1",0,0,{}]]]},{"name":"MySoftMax","class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"MySoftMax","trainable":true},"inbound_nodes":[[["MyDense_2",0,0,{}]]]}],"input_layers":[["MyConv2D_1_input",0,0]],"output_layers":[["MyConv2D_1",0,0],["MyMaxPooling_1",0,0],["MyConv2D_2",0,0],["MyMaxPooling_2",0,0],["MySoftMax",0,0]]},"keras_version":"tfjs-layers 0.7.5","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./encModel.weights.bin"],"weights":[{"name":"MyConv2D_1/kernel","shape":[5,5,1,6],"dtype":"float32"},{"name":"MyConv2D_1/bias","shape":[6],"dtype":"float32"},{"name":"MyConv2D_2/kernel","shape":[5,5,6,16],"dtype":"float32"},{"name":"MyConv2D_2/bias","shape":[16],"dtype":"float32"},{"name":"MyDense_1/kernel","shape":[256,120],"dtype":"float32"},{"name":"MyDense_1/bias","shape":[120],"dtype":"float32"},{"name":"MyDense_2/kernel","shape":[120,84],"dtype":"float32"},{"name":"MyDense_2/bias","shape":[84],"dtype":"float32"},{"name":"MySoftMax/kernel","shape":[84,10],"dtype":"float32"},{"name":"MySoftMax/bias","shape":[10],"dtype":"float32"}]}]}