{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"myPadding_input","class_name":"InputLayer","config":{"batch_input_shape":[null,28,28,1],"dtype":"float32","sparse":false,"name":"myPadding_input"},"inbound_nodes":[]},{"name":"myPadding","class_name":"ZeroPadding2D","config":{"padding":[[2,2],[2,2]],"data_format":"channels_last","name":"myPadding","trainable":true,"batch_input_shape":[null,28,28,1],"dtype":"float32"},"inbound_nodes":[[["myPadding_input",0,0,{}]]]},{"name":"myConv1","class_name":"Conv2D","config":{"filters":6,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"myConv1","trainable":true},"inbound_nodes":[[["myPadding",0,0,{}]]]},{"name":"myMaxPooling1","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"myMaxPooling1","trainable":true},"inbound_nodes":[[["myConv1",0,0,{}]]]},{"name":"myConv2","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"myConv2","trainable":true},"inbound_nodes":[[["myMaxPooling1",0,0,{}]]]},{"name":"myMaxPooling2","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"myMaxPooling2","trainable":true},"inbound_nodes":[[["myConv2",0,0,{}]]]},{"name":"myFlatten","class_name":"Flatten","config":{"name":"myFlatten","trainable":true},"inbound_nodes":[[["myMaxPooling2",0,0,{}]]]},{"name":"myDense1","class_name":"Dense","config":{"units":120,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myDense1","trainable":true},"inbound_nodes":[[["myFlatten",0,0,{}]]]},{"name":"myDense2","class_name":"Dense","config":{"units":84,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myDense2","trainable":true},"inbound_nodes":[[["myDense1",0,0,{}]]]},{"name":"myDense3","class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myDense3","trainable":true},"inbound_nodes":[[["myDense2",0,0,{}]]]}],"input_layers":[["myPadding_input",0,0]],"output_layers":[["myPadding",0,0],["myConv1",0,0],["myMaxPooling1",0,0],["myConv2",0,0],["myMaxPooling2",0,0],["myDense1",0,0],["myDense2",0,0],["myDense3",0,0]]},"keras_version":"tfjs-layers 0.8.5","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"myConv1/kernel","shape":[5,5,1,6],"dtype":"float32"},{"name":"myConv1/bias","shape":[6],"dtype":"float32"},{"name":"myConv2/kernel","shape":[5,5,6,16],"dtype":"float32"},{"name":"myConv2/bias","shape":[16],"dtype":"float32"},{"name":"myDense1/kernel","shape":[400,120],"dtype":"float32"},{"name":"myDense1/bias","shape":[120],"dtype":"float32"},{"name":"myDense2/kernel","shape":[120,84],"dtype":"float32"},{"name":"myDense2/bias","shape":[84],"dtype":"float32"},{"name":"myDense3/kernel","shape":[84,10],"dtype":"float32"},{"name":"myDense3/bias","shape":[10],"dtype":"float32"}]}]}